<?php
/**
 * Created by PhpStorm.
 * User: pil2ate
 * Date: 6/20/16 AD
 * Time: 1:13 PM
 */

namespace frontend\modules\newborn7\models;

use Yii;
use yii\helpers\ArrayHelper;


class ItemAlias extends \yii\db\ActiveRecord
{

    public function itemsAlias($key)
    {
        $items = [
            'milk' => [
                '1' => 'นมมารดาอย่างเดียว',
                '2' => 'นมมารดา + นมผสม',
                '3' => 'นมผสมอย่างเดียว',
                '99' => 'อื่นๆ'
            ],

            'vaccine' => [
                '1' => 'BCG',
                '2' => 'HBV',
                '3' => 'DTP-HBV-OPV1',
                '4' => 'DTP-HBV-OPV2',
                '5' => 'DTP-HBV-OPV3',
                '6' => 'MMR',
                '7' => 'JE1',
                '8' => 'JE2',
                '9' => 'JE3',
                '99' => 'อื่นๆ',
            ],

            'eye' => [
                '1' => 'ตรวจแล้ว',
                '2' => 'ไม่ได้ตรวจ',
                '3' => 'ผล NO ROP',
                '4' => 'ผล ROP Stage',
                '99' => 'อื่นๆ'
            ],

            'ear' => [
                '1' => 'ตรวจแล้ว',
                '2' => 'ไม่ได้ตรวจ',
                '3' => 'ผลปกติ',
                '4' => 'ผลไม่ปกติ',
                '99' => 'อื่นๆ'
            ],

            'ult' => [
                '1' => 'ตรวจแล้ว',
                '2' => 'ไม่ได้ตรวจ',
                '3' => 'ผลปกติ',
                '4' => 'ผลไม่ปกติ',
                '99' => 'อื่นๆ'
            ],
//            'dev' => [
//                '1' => 'มองหน้าแม่',
//                '2' => 'ตอบสนองเสียงพูด ทำเสียงในลำคอ',
//                '3' => 'เคลื่อนไหวแขนขาทั้งสองข้าง',
//                '4' => 'ยิ้มตอบยิ้มทักทาย',
//                '5' => 'แสดงท่าทีดีใจเมื่อแม่อุ้ม',
//                '6' => 'ทำเสียงอือา สนใจฟัง มองหาเสียง',
//                '7' => 'มองตามสิ่งเคลื่อนไหว',
//                '8' => 'ชันคอในท่าคว่ำ',
//                '9' => 'ทักทายคนคุ้นเคย',
//                '10' => 'หันหาเสียงหัวเราะส่งเสี้ยงอ้อแอ้โต้ตอบ',
//                '11' => 'เอามือจับกัน',
//                '12' => 'มองตามจาก ด้านหนึ่งจนสุดอีกด้านหนึ่ง',
//                '13' => 'ในท่าคว่ำใช้แขนยัน ชูคอตั้งขึ้น 90 องศา',
//                '14' => 'แสดงอารมและท่าทางดีใจ ขัดใจ จำหน้าพ่อแม่ได้',
//                '15' => 'หันตามเสียงเรียกชื่อ ส่งเสียงสูงต่ำ',
//                '16' => 'คว้าของมือเดียวและสลับมือถือของได้',
//                '17' => 'เริ่มพลิกคว่ำพลิกหงาย คืบ',
//                '18' => 'กลัวคนแลปหน้า ติดคนที่เลี้ยงดู',
//                '19' => 'ชูมือให้อุ้ม',
//                '20' => 'ทำเสียงจ๊ะจ๋าหม่ำๆ',
//                '21' => 'มองตามของตก',
//                '22' => 'นั่งทรงตัวได้เอง โดยไม่ต้องใช้มือยัน',
//                '23' => 'เล่นจ๊ะเอ ปรบมือ มองหาสิ่งมที่ซ่อนอยู่',
//                '24' => 'หยิบอาหารกินเอง',
//                '25' => 'ใช้ท่าทางบอกความต้องการ',
//                '26' => 'ฟังรู้ภาษา เข้าใจ สีหน้าท่าทาง ตอบสนอง',
//                '27' => 'ส่งเสียงหลายพยางค์ หม่ำๆ จ๊ะจ๋ามองหาของ',
//                '28' => 'ใช้นิ้วซี้และหัวแม่มือหยิบของ',
//                '29' => 'คลาน เกาะยืน เหนี่ยวตัว',
//                '30' => 'ลุกขึ้นจากท่านั้น',
//                '31' => 'เลียนแบบท่าทาง ไหว้ โบกเมือโยกตัวตามจังหวะเพลง หอมแก้ม',
//                '32' => 'ดื่มน้ำจากถ้วย',
//                '33' => 'พูดได้ 1 คำอย่างมีความหมาย',
//                '34' => 'เข้าใจเสียงห้ามและหยุดทำ',
//                '35' => 'สิ่งของขนาดพอมือ 2 อัน',
//                '36' => 'เคาะก้นยืนเองได้ชั่วครู่หรือตั้งไข',
//                '99' => 'อื่นๆ'
//            ],
        ];

        return ArrayHelper::getValue($items, $key, []);
    }

    public static function getItemMilk()
    {
        return self::itemsAlias('milk');
    }

    public static function getItemVaccine()
    {
        return self::itemsAlias('vaccine');
    }

    public static function getItemEye()
    {
        return self::itemsAlias('eye');
    }

    public static function getItemEar()
    {
        return self::itemsAlias('ear');
    }

    public static function getItemUlt()
    {
        return self::itemsAlias('ult');
    }

    public static function getItemDev()
    {
        return self::itemsAlias('dev');
    }



} 